Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: dakitaali/omufumu
en: [HEALTH_AND_MEDICINE_NOUN] doctor

source: dalizi
en: [GENERAL_NOUN] woven border on cloth

source: dambakaarra
en: [GENERAL_VERB] to be flabby, inert

source: damura/genda
en: [GENERAL_VERB] to move

source: demba
en: [GENERAL_NOUN] tolap

source: dibisa
en: [GENERAL_VERB] to rundown, defame

source: dyaka
en: [GENERAL_VERB] to become stupid,backward

source: digidigi
en: [GENERAL_NOUN] intensive with boha (fasten)

source: nyweza
en: [GENERAL_NOUN] tie tightly, tighten

source: diini
en: [GENERAL_NOUN] religion

source: diira
en: [GENERAL_NOUN] compass

source: dikira
en: [GENERAL_VERB] to sink

source: dikya
en: [GENERAL_VERB] to hit hard

source: dimiryangombe
en: [GENERAL_NOUN] blue soap

source: dimunadimu
en: [GENERAL_NOUN] seldom

source: dinga
en: [GENERAL_VERB] to become stupid

source: yongeza/kabiri
en: [GENERAL_VERB] to bubble

source: doma
en: [GENERAL_VERB] to bestupid, silly, foolish

source: domadoma
en: [GENERAL_VERB] to become stupid, foolish

source: domya
en: [GENERAL_VERB] to stupefy

source: doodokya
en: [GENERAL_VERB] to mock, ridicule

source: cementi
en: [GENERAL_NOUN] cement

source: dongoro
en: [GENERAL_NOUN] native soap

source: dooba
en: [GENERAL_VERB] to be stripped

source: dookooli
en: [GENERAL_VERB] be exhausted, done up

source: Dora
en: [GENERAL_NOUN] Look! Behold!

source: dubungura
en: [GENERAL_VERB] to hollow out, probe,lance

source: duduma
en: [GENERAL_VERB] to rumble, whirr, hum

source: dudura
en: [GENERAL_NOUN] beat unmercifully, flog

source: dundukya
en: [GENERAL_VERB] to tantalize

source: dundumuka
en: [GENERAL_VERB] to grow very quickly

source: kusumura
en: [GENERAL_VERB] to be very tall

source: duraamu
en: [GENERAL_NOUN] barrel

source: duubuuda
en: [GENERAL_VERB] to waste

source: duuka
en: [GENERAL_NOUN] shop

source: kurangira
en: [GENERAL_VERB] to announce, command, proclaim,interpret

source: duura
en: [GENERAL_NOUN] t oderide, scorn

source: dubura
en: [GENERAL_NOUN] drill

source: dai-dai
en: [GENERAL_NOUN] very hard

source: daburokara
en: [GENERAL_NOUN] double colour

source: dainingi
en: [GENERAL_NOUN] dining room

source: dara
en: [GENERAL_ADV] here is, there is

source: dereeva
en: [TRANSPORT_NOUN] driver

source: deero
en: [GENERAL_NOUN] now, today

source: disiko
en: [GENERAL_NOUN] discotheque

source: doboro
en: [GENERAL_NOUN] double: twice as much

source: doi doi
en: [GENERAL_VERB] making continous andirritating noise

source: doodo
en: [GENERAL_NOUN] amarinthus

source: ekidomora
en: [GENERAL_NOUN] jerrycan

source: ebidomora
en: [GENERAL_NOUN_PLURAL] jerrycans

source: ekidongodongo
en: [COMMON_ANIMALS_NOUN] a heron

source: ebidongodongo
en: [COMMON_ANIMALS_NOUN_PLURAL] herons

source: ekifubiro
en: [GENERAL_NOUN] punishment, penalty

source: ebifubiro
en: [GENERAL_NOUN_PLURAL] punishment, penalties

source: bikaiko
en: [GENERAL_NOUN] food without salt

source: ekifu kyenda
en: [GENERAL_NOUN] a very greedy person

source: ebifu kyenda
en: [GENERAL_NOUN_PLURAL] very greedy persons

source: ekifunjo mururuma
en: [GENERAL_NOUN] large intestine

source: ebifunjo mururuma
en: [GENERAL_NOUN_PLURAL] large intestines

source: ekigambo
en: [GENERAL_NOUN] a word

source: ebigambo
en: [GENERAL_NOUN_PLURAL] words

source: ekigango
en: [GENERAL_NOUN] room for catechism classes

source: ebigango
en: [GENERAL_NOUN_PLURAL] room for catechism classeses

source: ekidikizo
en: [GENERAL_NOUN] idiom

source: ebidikizo
en: [GENERAL_NOUN_PLURAL] idioms

source: ekidongo
en: [GENERAL_NOUN] a guitar

source: ebidongo
en: [GENERAL_NOUN_PLURAL] guitars

source: omudoma
en: [GENERAL_NOUN] a stupid person

source: abadoma
en: [GENERAL_NOUN_PLURAL] stupid persons

source: ebifuba
en: [GENERAL_NOUN_PLURAL] ekifubas

source: ekifufu
en: [GENERAL_NOUN] a bruise

source: ebifufu
en: [GENERAL_NOUN_PLURAL] bruises

source: endoboro/ensahu
en: [GENERAL_NOUN] a packet

source: ekisaniko
en: [GENERAL_NOUN] cover, used banana leaf

source: ebisaniko
en: [GENERAL_NOUN_PLURAL] cover, used banana leafs

source: ekifunjo
en: [GENERAL_NOUN] rectum

source: ekigaali/enengere
en: [GENERAL_NOUN] a wheel barrow

source: ebigaali/enegere
en: [GENERAL_NOUN_PLURAL] wheel barrows

source: kanyama
en: [GENERAL_NOUN] a tall mascular person

source: bakanyama
en: [GENERAL_NOUN_PLURAL] tall mascular persons

source: ekiganyiro
en: [GENERAL_NOUN] forgiveness

source: ebiganyiro
en: [GENERAL_NOUN_PLURAL] forgivenesses

source: ekigarukwamu
en: [GENERAL_NOUN] answer

source: ebigarukwamu
en: [GENERAL_NOUN_PLURAL] answers

source: ekigene
en: [GENERAL_NOUN] joke

source: ebigene
en: [GENERAL_NOUN_PLURAL] jokes

source: ekigiiko
en: [GENERAL_NOUN] spoon

source: ebigiiko
en: [GENERAL_NOUN_PLURAL] spoons

source: ekihano
en: [GENERAL_NOUN] something very surprising

source: ebihano
en: [GENERAL_NOUN_PLURAL] something very surprisings

source: ekigega
en: [GENERAL_NOUN] a big basket

source: ebigega
en: [GENERAL_NOUN_PLURAL] big baskets

source: ekigere
en: [GENERAL_NOUN] foot, foot print

source: ebigere
en: [GENERAL_NOUN_PLURAL] foot, foot prints

source: ekigigo
en: [GENERAL_NOUN] molar tooth

source: ebigigo
en: [GENERAL_NOUN_PLURAL] molar tooths

source: ekigunguru
en: [GENERAL_NOUN] a round plastic jerrycan

source: ebigunguru
en: [GENERAL_NOUN_PLURAL] round plastic jerrycans

source: ekihambo
en: [GENERAL_NOUN] a young pumpkin's garden

source: ebihambo
en: [GENERAL_NOUN_PLURAL] young pumpkin's gardens

source: ekihohe
en: [GENERAL_NOUN] soft immature calabash

source: ebihohe
en: [GENERAL_NOUN_PLURAL] soft immature calabashes

source: ekikyorooni
en: [GENERAL_NOUN] latrine

source: ebyorooni
en: [GENERAL_NOUN_PLURAL] latrines

source: ekijunjuuzi
en: [GENERAL_NOUN] beetle

source: ebijunjuuzi
en: [GENERAL_NOUN_PLURAL] beetles

source: ekijwaro
en: [GENERAL_NOUN] garment, wear

source: ebijwaro
en: [GENERAL_NOUN_PLURAL] garment, wears

source: ekikaali
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN] king's or chiefs enclosure

source: ebikaali
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN_PLURAL] king's or chiefs enclosures

source: ekikaijo
en: [GENERAL_NOUN] sugarcane

source: ebikaijo
en: [GENERAL_NOUN_PLURAL] sugarcanes

source: ekikaragwe
en: [GENERAL_NOUN] a tree specie

source: ebikaragwe
en: [GENERAL_NOUN_PLURAL] tree species

source: ekikindo
en: [GENERAL_NOUN] a palm tree

source: ebikindo
en: [GENERAL_NOUN_PLURAL] palm trees

source: ebikeke
en: [GENERAL_NOUN_PLURAL] pumpkins

source: ekikere
en: [GENERAL_NOUN] frog, toad

source: ebikere
en: [GENERAL_NOUN_PLURAL] frog, toads

source: ekikoco
en: [COMMON_ANIMALS_NOUN] an old emanciated cow

source: ebikoco
en: [COMMON_ANIMALS_NOUN_PLURAL] old emanciated cows

source: ekikongoriro
en: [GENERAL_NOUN] maize cob

source: ebikongoriro
en: [GENERAL_NOUN_PLURAL] maize cobs

source: ekikohi
en: [GENERAL_NOUN] eyelid

source: ebikohi
en: [GENERAL_NOUN_PLURAL] eyelids

source: ekikoikyo
en: [STORYTELLING_AND_NARRATIVES_NOUN] riddle

source: ebikoikyo
en: [STORYTELLING_AND_NARRATIVES_NOUN_PLURAL] riddles

source: ekikoligo
en: [GENERAL_NOUN] yoke problem, obstacle

source: ebikoligo
en: [GENERAL_NOUN_PLURAL] yoke problem, obstacles

source: ekikoobe
en: [GENERAL_NOUN] a herdsman's whistle

source: abalisa
en: [GENERAL_NOUN_PLURAL] herdsman's whistles

source: ekisoro
en: [GENERAL_NOUN] an animal

source: ebisoro
en: [GENERAL_NOUN_PLURAL] animals

source: ekikoosi
en: [MILITARY_NOUN] a battalion

source: ebikoosi
en: [MILITARY_NOUN_PLURAL] battalions

source: ekikopo
en: [GENERAL_NOUN] cup: a trophy

source: ebikopo
en: [GENERAL_NOUN_PLURAL] cup: a trophies

source: ekijunzire
en: [GENERAL_NOUN] rotten thing

source: ebijunzire
en: [GENERAL_NOUN_PLURAL] rotten things

source: ekika
en: [GENERAL_NOUN] sub-clan

source: ebika
en: [GENERAL_NOUN_PLURAL] sub-clans

source: ekikaguzo
en: [GENERAL_NOUN] question

source: ebikaguzo
en: [GENERAL_NOUN_PLURAL] questions

source: ekikarango
en: [GENERAL_NOUN] frying-pan

source: ebikarango
en: [GENERAL_NOUN_PLURAL] frying-pans

source: ekiijukyo
en: [GENERAL_NOUN] a memorial remembrance

source: ebiijukyo
en: [GENERAL_NOUN_PLURAL] memorial remembrances

source: ekijubwa
en: [GENERAL_NOUN] type of horizontal grass

source: ebijubwa
en: [GENERAL_NOUN_PLURAL] type of horizontal grasses

source: ekijuma
en: [GENERAL_NOUN] a fruit, a table

source: ebijuma
en: [GENERAL_NOUN_PLURAL] fruit, a tables

source: ekiina
en: [GENERAL_NOUN] hole, ditch, pit

source: ebiina
en: [GENERAL_NOUN_PLURAL] hole, ditch, pits

source: ekiinamirro
en: [GENERAL_NOUN] great grief, be sorrowful

source: ebiinamirro
en: [GENERAL_NOUN_PLURAL] great grief, be sorrowfuls

source: ekiisamuhana
en: [GENERAL_NOUN] large hornbill

source: ebiisamuhana
en: [GENERAL_NOUN_PLURAL] large hornbills

source: ekiisurumba
en: [GENERAL_NOUN] waterfall, rushing flood

source: ebiisurumba
en: [GENERAL_NOUN_PLURAL] waterfall, rushing floods

source: ekiisa-mutuutu
en: [GENERAL_NOUN] a big brown bird

source: ebiisa-mutuutu
en: [GENERAL_NOUN_PLURAL] big brown birds

source: ekijinja
en: [GENERAL_NOUN] a seasonal swamp

source: ebijinja
en: [GENERAL_NOUN_PLURAL] seasonal swamps

source: ekijoojo
en: [GENERAL_NOUN] fresh banana tree sheath

source: ebijoojo
en: [GENERAL_NOUN_PLURAL] fresh banana tree sheaths

source: ekijubwe
en: [NATURE_AND_ENVIRONMENT_NOUN] a type of grass

source: ebijubwe
en: [NATURE_AND_ENVIRONMENT_NOUN_PLURAL] type of grasses

source: ekijujuka
en: [GENERAL_NOUN] odour: unpleasant smell

source: ebijujuka
en: [GENERAL_NOUN_PLURAL] odour: unpleasant smells

source: ekijaju
en: [GENERAL_NOUN] exaggerated information

source: ebijaju
en: [GENERAL_NOUN_PLURAL] exaggerated informations

source: ekiihe
en: [GENERAL_NOUN] severe famine

source: ebiihe
en: [GENERAL_NOUN_PLURAL] severe famines

source: ekiijongo
en: [GENERAL_NOUN] a crater lake

source: ebiijongo
en: [GENERAL_NOUN_PLURAL] crater lakes

source: ekiika
en: [GENERAL_NOUN] heavy smoke

source: ebiika
en: [GENERAL_NOUN_PLURAL] heavy smokes

source: ekiikaro
en: [GENERAL_NOUN] place, spot

source: ebiikaro
en: [GENERAL_NOUN_PLURAL] place, spots

source: ekiju
en: [GENERAL_NOUN] a bird's nest

source: ebiju
en: [GENERAL_NOUN_PLURAL] bird's nests

source: ekijumo
en: [GENERAL_NOUN] an insult, an abuse

source: ebijumo
en: [GENERAL_NOUN_PLURAL] insult, an abuses

source: ekyoroni
en: [GENERAL_NOUN] pit latrine

source: ebyoroni
en: [GENERAL_NOUN_PLURAL] pit latrines

source: ekiituuru
en: [GENERAL_NOUN] a shade, shadow

source: ebiituuru
en: [GENERAL_NOUN_PLURAL] shade, shadows

source: ekijogojogo
en: [GENERAL_NOUN] a snail shell

source: ebijogojogo
en: [GENERAL_NOUN_PLURAL] snail shells

source: ekikaaka
en: [GENERAL_NOUN] giant

source: ebikaaka
en: [GENERAL_NOUN_PLURAL] giants

source: ekikaari
en: [GENERAL_NOUN] a reed fenced enclosure

source: ebikaari
en: [GENERAL_NOUN_PLURAL] reed fenced enclosures

source: ekijaguzo
en: [GENERAL_NOUN] festivity, celebration

source: ebijaguzo
en: [GENERAL_NOUN_PLURAL] festivity, celebrations

source: empale
en: [GENERAL_NOUN] knickers, trousers, shorts

source: empambiriza
en: [GENERAL_NOUN] one who uses force

source: empambo
en: [GENERAL_NOUN] seeds of gourds

source: empanuura
en: [GENERAL_NOUN] advice, counsel, discussion

source: emparacuki
en: [GENERAL_NOUN] swift runner

source: emparra
en: [COMMON_ANIMALS_NOUN] kind of locust

source: empataniza
en: [GENERAL_NOUN] space

source: empazi
en: [TOURISM_NOUN] safari ants

source: empeereza
en: [GENERAL_NOUN] service

source: empegecu
en: [GENERAL_NOUN] gristle, cartilage

source: empere
en: [GENERAL_NOUN] bed-bug

source: empeta
en: [GENERAL_NOUN] a ring

source: empiigi
en: [COMMON_ANIMALS_NOUN] hunting dog

source: empimbaale
en: [COMMON_ANIMALS_NOUN] a blind cow, goat

source: empitmpina
en: [COMMON_ANIMALS_NOUN] chameleon

source: empaama
en: [GENERAL_NOUN] poor soil, hard earth

source: empairimi
en: [COMMON_ANIMALS_NOUN] male dog

source: empakani
en: [GENERAL_NOUN] argumentative person, rival, competitor

source: empamo
en: [GENERAL_NOUN] mourning, lamentation

source: empanabeera
en: [GENERAL_NOUN] firm breasts not pendant

source: empara
en: [GENERAL_NOUN] Uganda Cob

source: emparangani
en: [GENERAL_NOUN] quarrelsome person

source: empata
en: [GENERAL_NOUN] constipation

source: empeehe
en: [GENERAL_NOUN] fluffy seeds of reeds

source: empeera
en: [GENERAL_NOUN] wage, pay, reward

source: empeese/enfuka empyaka
en: [GENERAL_NOUN] a new hoe

source: empekenyu
en: [GENERAL_NOUN] gristle, cartilage

source: empiigani
en: [GENERAL_NOUN] enmity, persecution

source: empirima
en: [GENERAL_NOUN] double edged sword, dagger

source: empogoma
en: [GENERAL_NOUN] hole in a tree

source: enkunguru
en: [GENERAL_NOUN] grasshoppers: small grasshoppers

source: enku
en: [GENERAL_NOUN] firewood

source: enkubebe
en: [COMMON_ANIMALS_NOUN] worker termite

source: enkubiti
en: [GENERAL_NOUN] strength, vigour

source: enkukuni
en: [GENERAL_NOUN] flea

source: enkumbititi
en: [GENERAL_NOUN] multitude, crowd,abundance

source: enkuna
en: [GENERAL_NOUN] hospitality, entertaining

source: enkunga
en: [COMMON_ANIMALS_NOUN] red tailed colobus monkey

source: enkunuukizi
en: [GENERAL_NOUN] hangnail

source: enkura
en: [COMMON_ANIMALS_NOUN] rhinoceros

source: enkurugu
en: [GENERAL_NOUN] cheat, swindler, crafty person

source: enkurungo
en: [GENERAL_NOUN] blue banana eater

source: enkuraijo
en: [NATURE_AND_ENVIRONMENT_NOUN] a plant species

source: enkorro
en: [GENERAL_NOUN] coughing disease, cough

source: enkubirane
en: [GENERAL_NOUN] repeatedly

source: enkukuuru
en: [GENERAL_NOUN] horn trumpet

source: enkumba
en: [GENERAL_NOUN] white millet

source: enkumo
en: [GENERAL_NOUN] fingers

source: enkunda
en: [GENERAL_NOUN] red-tailed cercopitheque

source: enkungani
en: [GENERAL_NOUN] strife, quarrel

source: enkunku
en: [GENERAL_NOUN] type of banana

source: enkunzi
en: [GENERAL_NOUN] lover

source: enkakaara
en: [GENERAL_NOUN] guinea fowl

source: enkurugusi
en: [GENERAL_NOUN] intruder

source: enkurungutaniza
en: [GENERAL_NOUN] subtlety, cunning, cheating

source: enkusi
en: [GENERAL_NOUN] stupid person

source: enkuuku
en: [GENERAL_NOUN] pigeon peas

source: enkwahwa
en: [GENERAL_NOUN] armpit

source: enkwanzi
en: [GENERAL_NOUN] beads

source: enkwatirizi
en: [GENERAL_NOUN] careful,deliberate, economical person

source: enkwato
en: [HEALTH_AND_MEDICINE_NOUN] care, good treatment, neatness

source: ensaagi
en: [GENERAL_NOUN] surplus

source: ensambani
en: [GENERAL_NOUN] an adulterous person

source: ensasanure
en: [GENERAL_NOUN] strippings from papyrus stems

source: ensongore
en: [COMMON_ANIMALS_NOUN] a male dog

source: ensumbi
en: [GENERAL_NOUN] SW.voilence or force

source: ekwanzi ekwanasana
en: [GENERAL_NOUN] big white beads

source: enobi
en: [GENERAL_NOUN] dislike, enmity, hatred

source: enondwa
en: [GENERAL_NOUN] tree with edible fruit

source: ensaali
en: [GENERAL_NOUN] loquats

source: ensaasi
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN] illness of king only

source: enkuya
en: [COMMON_ANIMALS_NOUN] large ape

source: enkuzi/onuhama
en: [GENERAL_NOUN] main root, tap root

source: enkwali
en: [GENERAL_NOUN] quail

source: enkwomoro
en: [GENERAL_NOUN] waning moon

source: ensamya
en: [GENERAL_NOUN] simsim

source: ensaija
en: [GENERAL_NOUN] a male animal

source: ensekure
en: [COMMON_ANIMALS_NOUN] a ram

source: ensoberwa
en: [GENERAL_NOUN] SW.a desparate person

source: ensoboorozi
en: [GENERAL_NOUN] SW.someone who explains something

source: ensoma
en: [GENERAL_NOUN] the way of reading

source: ensonga
en: [HEALTH_AND_MEDICINE_NOUN] menstruation period

source: ensoigo
en: [GENERAL_NOUN] honey guide bird

source: enombe
en: [GENERAL_NOUN] a soft red clay

source: ensamaaki
en: [GENERAL_NOUN] fish

source: ensaano
en: [GENERAL_NOUN] flour, powder

source: enseegu
en: [GENERAL_NOUN] pipe, flute

source: enseenene
en: [GENERAL_NOUN] edible grasshoppers

source: enseesekale
en: [GENERAL_NOUN] loose cents

source: enseiso
en: [GENERAL_NOUN] upper grinding stone

source: enseko
en: [GENERAL_NOUN] laughter, fun

source: ensemere
en: [GENERAL_NOUN] dear one, beloved

source: ensenge
en: [GENERAL_NOUN] giant hog

source: ensenyerre
en: [GENERAL_NOUN] good clear eyes

source: etanaki
en: [GENERAL_NOUN] nausea, vomit

source: ensi
en: [GEOGRAPHY_NOUN] earth, land, country

source: ensidirirwa
en: [GENERAL_NOUN] muzzle-loader

source: ensigo
en: [GENERAL_NOUN] kidney; seed

source: ensiiso
en: [GENERAL_NOUN] upper grind stone

source: ensimbi
en: [GENERAL_NOUN] money

source: ensinduro
en: [GENERAL_NOUN] full moon when rising

source: ensisana
en: [GENERAL_NOUN] shape, appearance

source: entaranta
en: [GENERAL_NOUN] talent: a natural gift

source: ensobi
en: [GENERAL_NOUN] mistake, error

source: ensama
en: [GENERAL_NOUN] reedbuck, water buck

source: ensandaigo
en: [GENERAL_NOUN] border of mat

source: ensazi
en: [GENERAL_NOUN] become very exhausted

source: ensekere
en: [GENERAL_NOUN] sty (in eye)

source: ensembukya
en: [GENERAL_NOUN] short-bladed spear

source: ensenada
en: [GENERAL_NOUN] cast

source: ensengo
en: [GENERAL_NOUN] fetters

source: ensere
en: [COMMON_ANIMALS_NOUN] hippopotamus

source: ensese
en: [HEALTH_AND_MEDICINE_NOUN] dysentery, diarrhoea with blood

source: ensibago
en: [GENERAL_NOUN] cane for bow string

source: ensibyemu
en: [GENERAL_NOUN] type of potato

source: ensiisira
en: [GENERAL_NOUN] temporary shelter

source: ensindizi
en: [COMMON_ANIMALS_NOUN] owl, sad, lonely person

source: ensinika
en: [GENERAL_NOUN] grin showing teeth

source: ensita
en: [GENERAL_NOUN] secret

source: ensoborra
en: [GENERAL_NOUN] explanation

source: ensoga
en: [GENERAL_NOUN] castor oil berry

source: ensogasoga
en: [GENERAL_NOUN] castor oil plant

source: ensohera
en: [GENERAL_NOUN] housefly

source: ensole
en: [COMMON_ANIMALS_NOUN] young dog, puppy

source: ensombabyoma
en: [GENERAL_NOUN] silkworm

source: ensondokozi
en: [GENERAL_NOUN] biting ant

source: ensongo y'omutwe
en: [GENERAL_NOUN] protruding, prominent forehead

source: ensonjogo
en: [HEALTH_AND_MEDICINE_NOUN] tertiary syphilis

source: ensonzi
en: [GENERAL_NOUN] small black fish

source: ensoro
en: [GENERAL_NOUN] spring of water

source: ensorrokano
en: [GENERAL_NOUN] assemblies

source: ensubiirizi
en: [GENERAL_NOUN] imitator

source: entaahi
en: [COMMON_ANIMALS_NOUN] swallow

source: entanaki
en: [GENERAL_NOUN] vomit

source: enteekateeka
en: [GENERAL_NUM] one's opinions and ideas

source: enteere
en: [GENERAL_NOUN] being very tired

source: ente-matako
en: [COMMON_ANIMALS_NOUN] a good female cow

source: entenge
en: [GENERAL_NOUN] small beads

source: ensunsunikizo
en: [GENERAL_NOUN] extreme edge, unsafe place

source: ensusu
en: [GENERAL_NOUN] flakes of skin

source: enswa
en: [GENERAL_NOUN] white ants

source: ensoha
en: [GENERAL_NOUN] water- jar

source: ensolima
en: [COMMON_ANIMALS_NOUN] large type of rat

source: ensombi
en: [GENERAL_NOUN] mud-fish

source: ensondo
en: [GENERAL_NOUN] cape of land

source: ensoni
en: [GENERAL_NOUN] shame, embarrassment

source: ensooki
en: [GENERAL_NOUN] insolent person

source: ensorooza
en: [GENERAL_NOUN] collection

source: ensubiiriza
en: [GENERAL_NOUN] imitation

source: enswiga
en: [GENERAL_NOUN] black nightshade

source: entabo n
en: [GENERAL_NOUN] red clay, fertile soil

source: entasumbuswa
en: [COMMON_ANIMALS_NOUN] an irreplaceable cow

source: entembarusaka
en: [GENERAL_NOUN] a type of potatoes

source: entetere
en: [GENERAL_NOUN] seeds of a pumpkin

source: entiizano
en: [GENERAL_NOUN] borrowed things

source: ensundi
en: [GENERAL_NOUN] small red bird, wax-bill

source: enyuma
en: [GENERAL_NOUN] behind

source: enyungu
en: [GENERAL_NOUN] pipe, earthenware, cooking-pot

source: enzibira-busa
en: [GENERAL_NOUN] a cartapillas cacoon

source: enziramira
en: [COMMON_ANIMALS_NOUN] python

source: enziiki
en: [GENERAL_NOUN] burial fee

source: enzira-kabi
en: [GENERAL_NOUN] a holy person

source: enzirigi
en: [GENERAL_NOUN] muscular and strong

source: enziransi
en: [GENERAL_NOUN] West wind

source: enzonza-mutima
en: [GENERAL_NOUN] deep sorrow or bitterness

source: erende
en: [GENERAL_NOUN] spoilt beer or porridge

source: enzooro
en: [GENERAL_NOUN] full moon

source: eraatiri
en: [GENERAL_NOUN] a pound

source: erangi
en: [GENERAL_NOUN] colour

source: eriiba
en: [GENERAL_NOUN] dove, pigeon

source: amaiba
en: [GENERAL_NOUN_PLURAL] dove, pigeons

source: eriiso-ry'ensi
en: [GENERAL_NOUN] abyss

source: amaiso-ry'ensi
en: [GENERAL_NOUN_PLURAL] abysses

source: erooro
en: [GENERAL_NOUN] thin or not fat

source: eruusi
en: [COMMON_ANIMALS_NOUN] young female goat

source: eryogero
en: [GENERAL_NOUN] bathroom

source: amaogero
en: [GENERAL_NOUN_PLURAL] bathrooms

source: esaasi
en: [GENERAL_NOUN] sympathy, mercy, kindness

source: esaara
en: [GENERAL_NOUN] prayer

source: enyuguta
en: [EDUCATION_AND_LEARNING_NOUN] letter of the alphabet

source: enyumbu
en: [COMMON_ANIMALS_NOUN] mule

source: enza
en: [GENERAL_NOUN] pubic Hair

source: enzaarwa
en: [GENERAL_NOUN] home-born, native, original

source: enziika
en: [GENERAL_NOUN] strong feeling of hatred

source: enzige
en: [COMMON_ANIMALS_NOUN] locust

source: enziha
en: [GENERAL_NOUN] deep water

source: enziku
en: [GENERAL_NOUN] gonorrhoea

source: enzini
en: [ART_AND_ENTERTAINMENT_NOUN] singer, dancer

source: enzizi
en: [GENERAL_NOUN] wound

source: ereka
en: [HEALTH_AND_MEDICINE_NOUN] shrub with much syrup

source: eriigenda
en: [GENERAL_NOUN] these days, nowadays

source: amaigenda
en: [GENERAL_NOUN_PLURAL] these days, nowadayses

source: enzooka
en: [GENERAL_NOUN] appearance, view

source: epipa
en: [GENERAL_NOUN] barrel, pipe

source: eri
en: [GENERAL_NOUN] which

source: amarogo
en: [GENERAL_NOUN_PLURAL] whiches

source: eriino
en: [GENERAL_NOUN] tooth

source: amaino
en: [GENERAL_NOUN_PLURAL] tooths

source: eryanda
en: [GENERAL_NOUN] a dry cell

source: amaanda
en: [GENERAL_NOUN_PLURAL] dry cells

source: eryato
en: [GENERAL_NOUN] a boat

source: amaato
en: [GENERAL_NOUN_PLURAL] boats

source: eryombera
en: [GENERAL_NOUN] season of weeding millet

source: amaombera
en: [GENERAL_NOUN_PLURAL] season of weeding millets

source: eruguru
en: [GENERAL_NOUN] top, overthere

source: eryana
en: [GENERAL_NOUN] childishness

source: engumba
en: [GENERAL_NOUN_PLURAL] childishnesses

source: esaatumba
en: [GENERAL_NOUN] aheap of unorganised things

source: esaati
en: [GENERAL_NOUN] shirt

source: esaiso
en: [GENERAL_NOUN] upper grinding stone

source: esasazi
en: [GENERAL_NOUN] sparks

source: esabwe
en: [GENERAL_NOUN] butter sauce

source: esafuliya
en: [GENERAL_NOUN] saucepan

source: esa
en: [GENERAL_NOUN] bandle of grass

source: esenza
en: [COMMON_ANIMALS_NOUN] SW.cane rat

source: esokondwa
en: [COMMON_ANIMALS_NOUN] caterpillar

source: esusure
en: [GENERAL_NOUN] type of yellow bananas

source: esuuka
en: [GENERAL_NOUN] bed sheets

source: esirabo
en: [GENERAL_NOUN] common duiker

source: esigara
en: [GENERAL_NOUN] cigarettes

source: esimu
en: [GENERAL_NOUN] telephone

source: esabbuuni
en: [GENERAL_NOUN] soap

source: esafaali
en: [GENERAL_NOUN] journey, tour

source: esagama
en: [GENERAL_NOUN] blood

source: esapuli
en: [GENERAL_NOUN] rosary

source: esarisari
en: [GENERAL_NOUN] SW.urine in droplets

source: esojo
en: [GENERAL_NOUN] Spear grass (Heteropogon contortus)

source: esweta
en: [GENERAL_NOUN] sweater

source: esiba
en: [GENERAL_NOUN] SW.section of a book

source: esimooni
en: [GENERAL_NOUN] fifty cents

source: esirimbi
en: [GENERAL_NOUN] whistle

source: etaaba
en: [GENERAL_NOUN] tobacco, cigeretts

source: etabaaro
en: [GENERAL_NOUN] placenta: the afterbirth

source: etabaaza
en: [GENERAL_NOUN] lantern

source: etarabuusu
en: [GENERAL_NOUN] turkish hut

source: etanka
en: [GENERAL_NOUN] tank

source: evaaro/eveero
en: [GENERAL_NOUN] veil

source: eveesiti
en: [GENERAL_NOUN] vest

source: eyange
en: [GENERAL_NOUN] mine
